---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.FileAccessException
source: html/e3679f96-8ea6-05e8-5939-6e7d25b2843d.htm
---
# FileAccessException Members

Retrieves data needed to serialize the target object.